trade/src/Documents/ИмпортПродукцииСАТУРН/ИмпортПродукцииСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИмпортПродукцииСАТУРН</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.МестаХраненияПартийСАТУРН</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПартийСАТУРН</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеИмпортПродукцииСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаЭкспортер</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <type>
      <types>CatalogRef.КлассификаторТранспортныхСредствСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТНАРГУС</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>DefinedType.ТранспортныеСредстваИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспортногоРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПункт</name>
    <type>
      <types>CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальноеУправление</name>
    <type>
      <types>CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПеревозчик</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмпортируемаяПартия</name>
      <type>
        <types>CatalogRef.ИмпортируемаяПартияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговоеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/AccumulationRegisters/ОстаткиПартийСАТУРН/ОстаткиПартийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПартийСАТУРН</name>
  <resources>
    <name>КоличествоСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <resources>
    <name>ВОбработкеСАТУРН</name>
    <type>
      <types>DefinedType.КоличествоСАТУРН</types>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

trade/src/InformationRegisters/МестаХраненияПартийСАТУРН/МестаХраненияПартийСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестаХраненияПартийСАТУРН</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/СоответствиеНоменклатурыСАТУРН/СоответствиеНоменклатурыСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеНоменклатурыСАТУРН</name>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПАТ</name>
    <type>
      <types>CatalogRef.КлассификаторПАТСАТУРН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииСАТУРН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/ТипыИзмеряемыхВеличинСАТУРН/ТипыИзмеряемыхВеличинСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзмеряемыхВеличинСАТУРН</name>
  <enumValues>
    <name>Вес</name>
  </enumValues>
  <enumValues>
    <name>Объем</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ИмпортируемаяПартияСАТУРН/ИмпортируемаяПартияСАТУРН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИмпортируемаяПартияСАТУРН</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВвоза</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСАТУРН</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>Маркировка</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАРГУС</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТНАРГУС</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОтправителяАРГУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредприятияРастаможиванияАРГУС</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаЭкспортер</name>
    <type>
      <types>CatalogRef.КлассификаторСтранСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспортногоСредства</name>
    <type>
      <types>CatalogRef.КлассификаторТранспортныхСредствСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПункт</name>
    <type>
      <types>CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальноеУправление</name>
    <type>
      <types>CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсходногоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПАТ</name>
    <type>
      <types>CatalogRef.КлассификаторПАТСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУпаковочнаяЕдиница</name>
    <type>
      <types>CatalogRef.КлючиЕдиницИзмеренияСАТУРН</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоличествоВУпаковкеСАТУРН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторПартии</name>
    <type>
      <types>DefinedType.СтрокаСАТУРН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПАТ</name>
      <type>
        <types>CatalogRef.КлассификаторПАТСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочнаяЕдиница</name>
      <type>
        <types>CatalogRef.КлючиЕдиницИзмеренияСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзмеряемойВеличиныСАТУРН</name>
      <type>
        <types>EnumRef.ТипыИзмеряемыхВеличинСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковкеСАТУРН</name>
      <type>
        <types>DefinedType.КоличествоВУпаковкеСАТУРН</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПартии</name>
      <type>
        <types>DefinedType.СтрокаСАТУРН</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Documents/ИмпортПродукцииСАТУРН/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура")Тогда
	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ИмпортируемаяПартияСАТУРН")
		ИЛИ (ТипДанныхЗаполнения = Тип("Массив")
		И ДанныеЗаполнения.Количество()
		И ТипЗнч(ДанныеЗаполнения[0]) = Тип("СправочникСсылка.ИмпортируемаяПартияСАТУРН"))Тогда 
		
		ЗаполнитьИмпортПродукцииПоДаннымПартииСАТУРН(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнтеграцияСАТУРНПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия");
	
	ЭтоИмпортИзЕАЭС               = Операция = Перечисления.ВидыОперацийСАТУРН.ИмпортПродукцииИзЕАЭС;
	ЭтоПредварительноеУведомление = Операция = Перечисления.ВидыОперацийСАТУРН.ИмпортПродукцииПредварительноеУведомление;
	
	Если Не ЭтоИмпортИзЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтранаЭкспортер");
		МассивНепроверяемыхРеквизитов.Добавить("Грузоотправитель");
		МассивНепроверяемыхРеквизитов.Добавить("ТипТранспорта");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.НомерПартии");
	КонецЕсли;
	
	Если Не ЭтоПредварительноеУведомление Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТерриториальноеУправление");
	КонецЕсли;
	
	Если ЭтоПредварительноеУведомление Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПолучения");
	КонецЕсли;
	
	Если Не ЭтоПредварительноеУведомление
		И Не ЭтоИмпортИзЕАЭС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодТНВЭД");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоУпаковок");
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""Продукция""'");
	
	Если ЭтоИмпортИзЕАЭС Или ЭтоПредварительноеУведомление Тогда
		
		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.НомерПартии) Или Не ЗначениеЗаполнено(СтрокаТовары.СрокГодности) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru = 'Данные партии'"), СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "ДанныеНовойПартии"),,
					Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоИмпортИзЕАЭС
		Или ЭтоПредварительноеУведомление Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоСАТУРН");
		
	КонецЕсли;
	
	ИнтеграцияСАТУРНПереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИмпортируемаяПартия) Тогда
			СтрокаТабличнойЧасти.Идентификатор = "";
		КонецЕсли;
		
	КонецЦикла;
	
	ИнтеграцияСАТУРН.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияСАТУРН.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЗначениеЗаполнено(ОбъектКопирования.Операция) Тогда
		Операция = Перечисления.ВидыОперацийСАТУРН.ИмпортПродукции;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
		
		СтрокаТабличнойЧасти.Идентификатор       = "";
		СтрокаТабличнойЧасти.ИмпортируемаяПартия = Справочники.ИмпортируемаяПартияСАТУРН.ПустаяСсылка();
		СтрокаТабличнойЧасти.Партия              = Справочники.ПартииСАТУРН.ПустаяСсылка();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ИмпортПродукцииСАТУРН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	РегистрыСведений.МестаХраненияПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеСАТУРН.ДанныеЗаполненияИмпортПродукцииСАТУРН(ОрганизацияСАТУРН, Операция);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеСАТУРН.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИмпортПродукцииПоДаннымПартииСАТУРН(ДанныеЗаполнения, ДополнитьДокумент = Ложь)

	РезультатДанныеИмпортныхПартий = ДанныеИмпортныхПартий(ДанныеЗаполнения);
	
	ДанныеШапки = РезультатДанныеИмпортныхПартий.ДанныеШапки;
	ДанныеТЧ    = РезультатДанныеИмпортныхПартий.ДанныеПартий;
	
	Если ДанныеШапки.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеШапки);
		
	КонецЕсли;
	
	Товары.Очистить();
	
	Пока ДанныеТЧ.Следующий() Цикл
		
		НоваяСтрокаТоваров = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, ДанныеТЧ);
		
	КонецЦикла;
	
	ДанныеУпаковок = ИнтеграцияИСВызовСервера.КоэффициентВесОбъемУпаковок(Товары);
	
	Для Каждого Строка Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеУпаковки = ИнтеграцияИСКлиентСервер.ПолучитьДанныеУпаковки(
			ДанныеУпаковок, Строка.Номенклатура, Строка.Упаковка);
		
		Если Строка.ТипИзмеряемойВеличиныСАТУРН = Перечисления.ТипыИзмеряемыхВеличинСАТУРН.Вес Тогда
			Коэффициент = ДанныеУпаковки.Вес;
		ИначеЕсли Строка.ТипИзмеряемойВеличиныСАТУРН = Перечисления.ТипыИзмеряемыхВеличинСАТУРН.Объем Тогда
			Коэффициент = ДанныеУпаковки.Объем;
		Иначе
			Коэффициент = 0;
		КонецЕсли;
		
		Строка.КоличествоУпаковок = Строка.КоличествоСАТУРН * Коэффициент;
		Строка.Количество = Строка.КоличествоУпаковок;
		
	КонецЦикла;

КонецПроцедуры

Функция ДанныеИмпортныхПартий(МассивИмпортныхПартий)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивИмпортныхПартий);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствиеНоменклатуры.ПАТ                      КАК ПАТ,
	|	МАКСИМУМ(СоответствиеНоменклатуры.Номенклатура)   КАК Номенклатура,
	|	МАКСИМУМ(СоответствиеНоменклатуры.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ СоответствиеНоменклатуры
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыСАТУРН КАК СоответствиеНоменклатуры
	|ГДЕ
	|	СоответствиеНоменклатуры.ПАТ В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПАТ
	|		ИЗ
	|			Справочник.ИмпортируемаяПартияСАТУРН
	|		ГДЕ
	|			Ссылка В (&МассивСсылок))
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатуры.ПАТ
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеНоменклатуры.Номенклатура) = 1
	|	И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеНоменклатуры.Характеристика) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИмпортируемаяПартияСАТУРН.ОрганизацияСАТУРН               КАК ОрганизацияСАТУРН,
	|	ИмпортируемаяПартияСАТУРН.МестоХранения                   КАК МестоХранения,
	|	ИмпортируемаяПартияСАТУРН.ДатаПолучения                   КАК ДатаПолучения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСАТУРН.ИмпортПродукции) КАК Операция
	|ИЗ
	|	Справочник.ИмпортируемаяПартияСАТУРН КАК ИмпортируемаяПартияСАТУРН
	|ГДЕ
	|	ИмпортируемаяПартияСАТУРН.Ссылка В (&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИмпортируемаяПартияСАТУРН.Ссылка                       КАК ИмпортируемаяПартия,
	|	ИмпортируемаяПартияСАТУРНТовары.ПАТ                    КАК ПАТ,
	|	ИмпортируемаяПартияСАТУРНТовары.КоличествоВУпаковкеСАТУРН КАК КоличествоВУпаковкеСАТУРН,
	|	ИмпортируемаяПартияСАТУРНТовары.КоличествоУпаковок * ИмпортируемаяПартияСАТУРНТовары.КоличествоВУпаковкеСАТУРН КАК
	|		КоличествоСАТУРН,
	|	ИмпортируемаяПартияСАТУРНТовары.ТипИзмеряемойВеличиныСАТУРН КАК ТипИзмеряемойВеличиныСАТУРН,
	|	ИмпортируемаяПартияСАТУРНТовары.ИдентификаторСтроки    КАК Идентификатор,
	|	СоответствиеНоменклатуры.Номенклатура                  КАК Номенклатура,
	|	СоответствиеНоменклатуры.Характеристика                КАК Характеристика
	|ИЗ
	|	Справочник.ИмпортируемаяПартияСАТУРН КАК ИмпортируемаяПартияСАТУРН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИмпортируемаяПартияСАТУРН.Товары КАК ИмпортируемаяПартияСАТУРНТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|				ПО ИмпортируемаяПартияСАТУРНТовары.ПАТ = СоответствиеНоменклатуры.ПАТ
	|			ПО ИмпортируемаяПартияСАТУРН.Ссылка = ИмпортируемаяПартияСАТУРНТовары.Ссылка
	|ГДЕ
	|	ИмпортируемаяПартияСАТУРН.Ссылка В (&МассивСсылок)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВГраница = РезультатЗапроса.ВГраница();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДанныеШапки",  РезультатЗапроса[ВГраница-1].Выбрать());
	СтруктураВозврата.Вставить("ДанныеПартий", РезультатЗапроса[ВГраница].Выбрать());
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
